Revit 2024 API
Parameter.HasValue Property
Identifies if the parameter has an assigned value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool HasValue { get; }
Visual Basic
Public ReadOnly Property HasValue As Boolean
	Get
Visual C++
public:
property bool HasValue {
	bool get ();
}
See Also
Parameter Class
Autodesk.Revit.DB Namespace